app/controllers/api/restrictions_controller.rb

  def show
    # get restrictions for a given PHU ID
    healthRegion = HealthRegion.find_by(region_code: params[:id])
    stage = Stage.joins(:health_regions).where("region_code = ?", params[:id])
---
SELECT  "health_regions".* FROM "health_regions" WHERE "health_regions"."region_code" = ? LIMIT 1  [["region_code", "2262"]]
SELECT "stages".* FROM "stages" INNER JOIN "health_regions" ON "health_regions"."stage_id" = "stages"."id" WHERE (region_code = '2262')