app/controllers/admin/dashboard_controller.rb

SELECT COUNT(*) FROM "admins"
SELECT COUNT(*) FROM "health_regions"
SELECT COUNT(*) FROM "stages"
---
  def index
    @data = {
      admins: Admin.all.count,
      health_regions: HealthRegion.all.count,
      stages: Stage.all.count