app/controllers/admin/stages_controller.rb

  def index
    @stages = Stage.all
---
SELECT "stages".* FROM "stages"